[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:61:46
               id="requesteremail"
               type="text"
               isInvalid={Boolean(errors.requesteremail)}
-              {...register("requesteremail", {
-                required: true,
-                pattern: email_regex,
-              })}
+              {...register("requesteremail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester email must be in format <email>@<domain>\.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:62:27
               type="text"
               isInvalid={Boolean(errors.requesteremail)}
               {...register("requesteremail", {
-                required: true,
+                required: false,
                 pattern: email_regex,
               })}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:67:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesteremail && "Requester email is required. "}
+              {errors.requesteremail || "Requester email is required. "}
               {errors.requesteremail?.type === "pattern" &&
                 "Requester email must be in format <email>@<domain>.<extension>"}
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester email must be in format <email>@<domain>\.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:67:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesteremail && "Requester email is required. "}
+              {true}
               {errors.requesteremail?.type === "pattern" &&
                 "Requester email must be in format <email>@<domain>.<extension>"}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:68:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesteremail && "Requester email is required. "}
-              {errors.requesteremail?.type === "pattern" &&
-                "Requester email must be in format <email>@<domain>.<extension>"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester email must be in format <email>@<domain>\.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:68:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesteremail && "Requester email is required. "}
-              {errors.requesteremail?.type === "pattern" &&
+              {errors.requesteremail.type === "pattern" &&
                 "Requester email must be in format <email>@<domain>.<extension>"}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:82:46
               id="professoremail"
               type="text"
               isInvalid={Boolean(errors.professoremail)}
-              {...register("professoremail", {
-                required: true,
-                pattern: email_regex,
-              })}
+              {...register("professoremail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Professor email must be in format <email>@<domain>.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:83:27
               type="text"
               isInvalid={Boolean(errors.professoremail)}
               {...register("professoremail", {
-                required: true,
+                required: false,
                 pattern: email_regex,
               })}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Professor email is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:88:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professoremail && "Professor email is required. "}
+              {errors.professoremail || "Professor email is required. "}
               {errors.professoremail?.type === "pattern" &&
                 "Professor email must be in format <email>@<domain>.<extension>"}
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester email must be in format <email>@<domain>\.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:88:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professoremail && "Professor email is required. "}
+              {false}
               {errors.professoremail?.type === "pattern" &&
                 "Professor email must be in format <email>@<domain>.<extension>"}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Professor email is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:89:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professoremail && "Professor email is required. "}
-              {errors.professoremail?.type === "pattern" &&
-                "Professor email must be in format <email>@<domain>.<extension>"}
+              {errors.professoremail?.type === "pattern" || "Professor email must be in format <email>@<domain>.<extension>"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Professor email must be in format <email>@<domain>.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:89:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professoremail && "Professor email is required. "}
-              {errors.professoremail?.type === "pattern" &&
-                "Professor email must be in format <email>@<domain>.<extension>"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Professor email must be in format <email>@<domain>.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:90:17
             <Form.Control.Feedback type="invalid">
               {errors.professoremail && "Professor email is required. "}
               {errors.professoremail?.type === "pattern" &&
-                "Professor email must be in format <email>@<domain>.<extension>"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Professor email must be in format <email>@<domain>.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:122:45
               id="daterequested"
               type="datetime-local"
               isInvalid={Boolean(errors.daterequested)}
-              {...register("daterequested", {
-                required: true,
-                pattern: isodate_regex,
-              })}
+              {...register("daterequested", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Date requested required and must be in ISO format\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:123:27
               type="datetime-local"
               isInvalid={Boolean(errors.daterequested)}
               {...register("daterequested", {
-                required: true,
+                required: false,
                 pattern: isodate_regex,
               })}
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Date requested required and must be in ISO format\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:128:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.daterequested && "Date requested required and must be in ISO format."}
+              {errors.daterequested || "Date requested required and must be in ISO format."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester email must be in format <email>@<domain>\.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:128:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.daterequested && "Date requested required and must be in ISO format."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Date requested required and must be in ISO format\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:141:28
               id="dateneeded"
               type="datetime-local"
               isInvalid={Boolean(errors.dateneeded)}
-              {...register("dateneeded", {
+              {...register("", {
                 required: true,
                 pattern: isodate_regex,
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:142:27
               type="datetime-local"
               isInvalid={Boolean(errors.dateneeded)}
               {...register("dateneeded", {
-                required: true,
+                required: false,
                 pattern: isodate_regex,
               })}
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Date needed required and must be in ISO format\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:147:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateneeded && "Date needed required and must be in ISO format."}
+              {errors.dateneeded || "Date needed required and must be in ISO format."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester email must be in format <email>@<domain>\.<extension>/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:147:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateneeded && "Date needed required and must be in ISO format."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Date needed required and must be in ISO format\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:159:28
               id="done"
               type="checkbox"
               label="Done"
-              {...register("done")}
+              {...register("")}
             />
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')
