[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:40:20
     },
     {
       header: "RequesterEmail",
-      accessorKey: "requesteremail",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-requesteremail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:44:20
     },
     {
       header: "ProfessorEmail",
-      accessorKey: "professoremail",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professoremail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:51:15
       accessorKey: "explanation",
     },
     {
-      header: "DateRequested",
+      header: "",
       accessorKey: "daterequested",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: DateRequested. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:56:20
     },
     {
       header: "DateNeeded",
-      accessorKey: "dateneeded",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateneeded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.jsx:64:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={recommendationRequests} columns={columns} testid={"RecommendationRequestTable"} />;
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:66:28
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"),
+      ButtonColumn("Edit", "", editCallback, "RecommendationRequestTable"),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:69:56
       ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"),
+      ButtonColumn("Delete", "danger", deleteCallback, ""),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:69:20
       ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"),
+      ButtonColumn("", "danger", deleteCallback, "RecommendationRequestTable"),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:73:76
     );
   }
 
-  return <OurTable data={recommendationRequests} columns={columns} testid={"RecommendationRequestTable"} />;
+  return <OurTable data={recommendationRequests} columns={columns} testid={""} />;
 }
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
