[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      requesteremail: recommendationRequest.requesteremail,
-      professoremail: recommendationRequest.professoremail,
-      explanation: recommendationRequest.explanation,
-      daterequested: recommendationRequest.daterequested,
-      dateneeded: recommendationRequest.dateneeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "RecommendationRequest Updated - id: 17 requester email: ai1@mail.com",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:44:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(`RecommendationRequest Updated - id: ${recommendationRequest.id} requester email: ${recommendationRequest.requesteremail}`);
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit RecommendationRequest</h1>
-        {recommendationRequest && (
-          <RecommendationRequestForm
-            initialContents={recommendationRequest}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: RecommendationRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-requesteremail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
