[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:52:33
           id="title"
           type="text"
           isInvalid={Boolean(errors.title)}
-          {...register("title", {
-            required: "Title is required",
-            maxLength: {
-              value: 30,
-              message: "Title: Max length 30 characters",
-            },
-          })}
+          {...register("title", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:74:24
           isInvalid={Boolean(errors.url)}
           {...register("url", {
             required: "Url is required",
-            maxLength: {
-              value: 30,
-              message: "Url: Max length 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Url: Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:114:22
           isInvalid={Boolean(errors.email)}
           {...register("email", {
             required: "Email is required",
-            pattern: {
-              value: regex,
-              message: "Please enter a valid email address",
-            },
+            pattern: {},
           })}
         />
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Please enter a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:138:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded &&
-            "DateAdded is required and must be in ISO format"}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /DateAdded is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.jsx:138:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded &&
-            "DateAdded is required and must be in ISO format"}
+          {errors.dateAdded || "DateAdded is required and must be in ISO format"}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Title is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:139:13
         />
         <Form.Control.Feedback type="invalid">
           {errors.dateAdded &&
-            "DateAdded is required and must be in ISO format"}
+            ""}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /DateAdded is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
