[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:42:5
       header: "Title",
       accessorKey: "title",
     },
-    {
-      header: "Url",
-      accessorKey: "url",
-    },
+    {},
     {
       header: "Explanation",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header
