[Killed] StringLiteral
main/pages/Articles/ArticlesCreatePage.jsx:9:10
 
 export default function ArticlesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (articles) => ({
-    url: "/api/articles/post",
+    url: "",
     method: "POST",
     params: {
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New articles Created - id: 17 title: nameTitle",

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:20:35
     },
   });
 
-  const onSuccess = (articles) => {
-    toast(
-      `New articles Created - id: ${articles.id} title: ${articles.title}`,
-    );
-  }
+  const onSuccess = (articles) => {}
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
