[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.jsx:43:35
     },
   });
 
-  const onSuccess = (articles) => {
-    toast(`Articles Updated - id: ${articles.id} title: ${articles.title}`);
-  };
+  const onSuccess = (articles) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
