[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:53:26
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
                 required: "Requester email is required.",
-                pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/i,
-                  message: "Please enter a valid email address.",
-                },
+                pattern: {},
               })}
             />
killedBy: HelpRequestForm tests shows email validation message on bad email
statusReason: Unable to find an element with the text: /Please enter a valid email address\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.jsx:54:26
               {...register("requesterEmail", {
                 required: "Requester email is required.",
                 pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/i,
+                  value: /^[^\s@]+@[^\s@]\.[^\s@]+$/i,
                   message: "Please enter a valid email address.",
                 },
killedBy: HelpRequestForm tests submits correct data on good input
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] Regex
main/components/HelpRequest/HelpRequestForm.jsx:54:26
               {...register("requesterEmail", {
                 required: "Requester email is required.",
                 pattern: {
-                  value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/i,
+                  value: /^[\s@]+@[^\s@]+\.[^\s@]+$/i,
                   message: "Please enter a valid email address.",
                 },
killedBy: HelpRequestForm tests submits correct data on good input
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:75:38
               id="teamId"
               type="text"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", {
-                required: "Team id is required.",
-              })}
+              {...register("teamId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests shows messages on missing input
statusReason: Unable to find an element with the text: /Team id is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.jsx:120:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime &&
-                "Request time is required and must be in ISO format."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests shows messages on missing input
statusReason: Unable to find an element with the text: /Request time is required and must be in ISO format\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.jsx:120:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime &&
-                "Request time is required and must be in ISO format."}
+              {errors.requestTime || "Request time is required and must be in ISO format."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests shows messages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:138:28
                 required: "Explanation is required.",
                 maxLength: {
                   value: 255,
-                  message: "Explanation must be 255 characters or less.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests shows max length message on long explanation
statusReason: Unable to find an element with the text: /Explanation must be 255 characters or less\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:157:28
               type="checkbox"
               id="solved"
               label="Solved?"
-              {...register("solved")}
+              {...register("")}
             />
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly for create (no id)
statusReason: Cannot read properties of undefined (reading '_f')
