[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:34:47
 
   const columns = [
     { header: "id", accessorKey: "id" },
-    { header: "Requester Email", accessorKey: "requesterEmail" },
+    { header: "Requester Email", accessorKey: "" },
     { header: "Team Id", accessorKey: "teamId" },
     { header: "Table / Breakout Room", accessorKey: "tableOrBreakoutRoom" },
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:35:5
   const columns = [
     { header: "id", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
-    { header: "Team Id", accessorKey: "teamId" },
+    {},
     { header: "Table / Breakout Room", accessorKey: "tableOrBreakoutRoom" },
     { header: "Request Time", accessorKey: "requestTime" },
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:35:39
   const columns = [
     { header: "id", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
-    { header: "Team Id", accessorKey: "teamId" },
+    { header: "Team Id", accessorKey: "" },
     { header: "Table / Breakout Room", accessorKey: "tableOrBreakoutRoom" },
     { header: "Request Time", accessorKey: "requestTime" },
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:37:44
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Team Id", accessorKey: "teamId" },
     { header: "Table / Breakout Room", accessorKey: "tableOrBreakoutRoom" },
-    { header: "Request Time", accessorKey: "requestTime" },
+    { header: "Request Time", accessorKey: "" },
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Solved", accessorKey: "solved" },
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requestTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:38:15
     { header: "Team Id", accessorKey: "teamId" },
     { header: "Table / Breakout Room", accessorKey: "tableOrBreakoutRoom" },
     { header: "Request Time", accessorKey: "requestTime" },
-    { header: "Explanation", accessorKey: "explanation" },
+    { header: "", accessorKey: "explanation" },
     { header: "Solved", accessorKey: "solved" },
   ];
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Explanation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:38:43
     { header: "Team Id", accessorKey: "teamId" },
     { header: "Table / Breakout Room", accessorKey: "tableOrBreakoutRoom" },
     { header: "Request Time", accessorKey: "requestTime" },
-    { header: "Explanation", accessorKey: "explanation" },
+    { header: "Explanation", accessorKey: "" },
     { header: "Solved", accessorKey: "solved" },
   ];
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-explanation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"
