[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.jsx:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New HelpRequest Created - id: ${helpRequest.id} requesterEmail: ${helpRequest.requesterEmail}`,
-    );
-  }
+  const onSuccess = (helpRequest) => {}
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests submits form and it make a request to backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
