[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/helprequest?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/helprequest`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: HelpRequestEditPage tests when the backend returns data renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/helprequest`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: HelpRequestEditPage tests when the backend returns data renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.jsx:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(`Help Request Updated - id: ${helpRequest.id} Email: ${helpRequest.requesterEmail}`);
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests when the backend returns data Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.jsx:61:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/helprequest" />;
-  }
+  if (isSuccess) {}
 
   return (
killedBy: HelpRequestEditPage tests when the backend returns data Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ { to: '/helprequest' } ]

Number of calls: 0
