[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestIndexPage.jsx:33:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/helprequest/all"],
-    { method: "GET", url: "/api/helprequest/all" },
+    {},
     [],
   );
killedBy: HelpRequestIndexPage tests Renders three help requests are correctly for regular user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
