[Killed] BlockStatement
src/main/utils/helpRequestUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/helprequest",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
killedBy: HelpRequestIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Help Request with id 1 was deleted",
