[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:60:28
               id="diningcommonscode"
               type="text"
               isInvalid={Boolean(errors.diningcommonscode)}
-              {...register("diningcommonscode", {
+              {...register("", {
                 required: "Dining Commons Code is required.",
                 //pattern: yyyyq_regex,
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.jsx:60:49
               id="diningcommonscode"
               type="text"
               isInvalid={Boolean(errors.diningcommonscode)}
-              {...register("diningcommonscode", {
-                required: "Dining Commons Code is required.",
-                //pattern: yyyyq_regex,
-              })}
+              {...register("diningcommonscode", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
