[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:46:37
             id="orgcode"
             type="text"
             isInvalid={Boolean(errors.orgcode)}
-            {...register("orgcode", {
-              required: "Organization code is required.",
-              maxLength: {
-                value: 10,
-                message: "Max length 10 characters",
-              },
-            })}
+            {...register("orgcode", {})}
           />
           <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Organization code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:47:25
             type="text"
             isInvalid={Boolean(errors.orgcode)}
             {...register("orgcode", {
-              required: "Organization code is required.",
+              required: "",
               maxLength: {
                 value: 10,
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Organization code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:55:14
             })}
           />
           <Form.Control.Feedback type="invalid">
-            {errors.orgcode?.message}
+            {errors.orgcode.message}
           </Form.Control.Feedback>
         </Form.Group>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:106:72
           label="Inactive?"
           type="checkbox"
           {...register("inactive")}
-          defaultChecked={initialContents ? initialContents.inactive : false}
+          defaultChecked={initialContents ? initialContents.inactive : true}
         />
       </Form.Group>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="UCSBOrganizationForm-inactive"
  id="inactive"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:111:57
       </Form.Group>
 
       {/* buttons */}
-      <Button type="submit" data-testid={testIdPrefix + "-submit"}>
+      <Button type="submit" data-testid={testIdPrefix + ""}>
         {buttonLabel}
       </Button>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-submit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
