[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsborganization/edit/${cell.row.original.orgcode}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/ucsborganization/edit/SWE' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:37:5
   };
 
   const columns = [
-    {
-      header: "Org Code",
-      accessorKey: "orgcode",
-    },
+    {},
     {
       header: "Short Translation",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:39:20
   const columns = [
     {
       header: "Org Code",
-      accessorKey: "orgcode",
+      accessorKey: "",
     },
     {
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgcode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:49:5
       header: "Full Translation",
       accessorKey: "orgTranslation",
     },
-    {
-      header: "Inactive?",
-      accessorKey: "inactive",
-      cell: ({ getValue }) => (getValue() ? "Yes" : "No"),
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:50:15
       accessorKey: "orgTranslation",
     },
     {
-      header: "Inactive?",
+      header: "",
       accessorKey: "inactive",
       cell: ({ getValue }) => (getValue() ? "Yes" : "No"),
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Inactive?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:51:20
     },
     {
       header: "Inactive?",
-      accessorKey: "inactive",
+      accessorKey: "",
       cell: ({ getValue }) => (getValue() ? "Yes" : "No"),
     },
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-inactive"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:52:13
     {
       header: "Inactive?",
       accessorKey: "inactive",
-      cell: ({ getValue }) => (getValue() ? "Yes" : "No"),
+      cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  No
Received:
