[Killed] BlockStatement
src/main/utils/ucsbOrganizationUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganization",
-    method: "DELETE",
-    params: {
-      orgcode: cell.row.original.orgcode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
src/main/utils/ucsbOrganizationUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganization",
-    method: "DELETE",
-    params: {
-      orgcode: cell.row.original.orgcode,
-    },
-  };
+  return {};
 }
 
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
src/main/utils/ucsbOrganizationUtils.js:12:13
   return {
     url: "/api/ucsborganization",
     method: "DELETE",
-    params: {
-      orgcode: cell.row.original.orgcode,
-    },
+    params: {},
   };
 }
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected {} to deeply equal { orgcode: 'SWE' }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table
